apache/nuttx/arch/arm/src/imxrt/imxrt_enet.c
/****************************************************************************
 * arch/arm/src/imxrt/imxrt_enet.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <time.h>
#include <string.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <errno.h>
#include <endian.h>

#include <arpa/inet.h>

#include <nuttx/wdog.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/spinlock.h>
#include <nuttx/wqueue.h>
#include <nuttx/signal.h>
#include <nuttx/net/mii.h>
#include <nuttx/net/phy.h>
#include <nuttx/net/ip.h>
#include <nuttx/net/netdev.h>

#ifdef CONFIG_NET_PKT
#  include <nuttx/net/pkt.h>
#endif

#include <arch/barriers.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "imxrt_config.h"
#include "hardware/imxrt_enet.h"
#include "hardware/imxrt_ccm.h"
#include "hardware/imxrt_pinmux.h"
#include "imxrt_periphclks.h"
#include "imxrt_gpio.h"
#include "imxrt_enet.h"
#ifdef CONFIG_ARCH_FAMILY_IMXRT117x
#include "hardware/rt117x/imxrt117x_ocotp.h"
#else
#include "hardware/imxrt_ocotp.h"
#endif

#ifdef CONFIG_IMXRT_ENET

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* If processing is not done at the interrupt level, then work queue support
 * is required.
 */

#if !defined(CONFIG_SCHED_WORKQUEUE)
#  error Work queue support is required
#else

  /* Select work queue.  Always use the LP work queue if available.  If not,
   * then LPWORK will re-direct to the HP work queue.
   *
   * NOTE:  However, the network should NEVER run on the high priority work
   * queue!  That queue is intended only to service short back end interrupt
   * processing that never suspends.  Suspending the high priority work queue
   * may bring the system to its knees!
   */

#  define ETHWORK LPWORK
#endif

/* CONFIG_IMXRT_ENET_NETHIFS determines the number of physical interfaces
 * that will be supported.
 *
 * The current driver only supports one interface chosen at compile time.
 * It may be either ETH1 or ETH2. In the future 2 interfaces may be
 * supported.
 */

#if CONFIG_IMXRT_ENET_NETHIFS != 1
#  error "CONFIG_IMXRT_ENET_NETHIFS must be one for now"
#endif

#if defined(CONFIG_IMXRT_ENET1) && defined(CONFIG_IMXRT_ENET2)
#  error "The current driver only supports one interface CONFIG_IMXRT_ENET{1|2}"
#endif

#if defined(CONFIG_IMXRT_MAC_PROVIDES_TXC) && \
    defined(CONFIG_IMXRT_PHY_PROVIDES_TXC)
#  error "Only one of CONFIG_IMXRT_PHY_PROVIDES_TXC, CONFIG_IMXRT_MAC_PROVIDES_TXC can be selected"
#endif
#if !defined(CONFIG_IMXRT_MAC_PROVIDES_TXC) && \
    !defined(CONFIG_IMXRT_PHY_PROVIDES_TXC)
#  error "One of CONFIG_IMXRT_PHY_PROVIDES_TXC, CONFIG_IMXRT_MAC_PROVIDES_TXC must be selected"
#endif

#ifdef CONFIG_ARCH_FAMILY_IMXRT117x
#  if defined(CONFIG_IMXRT_ENET1)
#    define IMXRT_ENET_IOMUXC_GPR    IMXRT_IOMUXC_GPR_GPR4
#    define imxrt_clock_enet         imxrt_clockall_enet
#    define GPR_ENET_MASK           (GPR_GPR4_ENET_TX_CLK_SEL | \
                                     GPR_GPR4_ENET_REF_CLK_DIR)
#    define IMXRT_ENET_IRQ           IMXRT_IRQ_ENET
#    define IMXRT_ENETN_BASE         IMXRT_ENET_BASE
#    if defined(CONFIG_IMXRT_MAC_PROVIDES_TXC)
#      define GPR_ENET_TX_DIR        GPR_GPR4_ENET_REF_CLK_DIR_OUT
#      define GPR_ENET_CLK_SEL       GPR_GPR4_ENET_TX_CLK_SEL_NS
#    endif
#    if defined(CONFIG_IMXRT_PHY_PROVIDES_TXC)
#      define GPR_ENET_TX_DIR        GPR_GPR4_ENET_REF_CLK_DIR_IN
#      define GPR_ENET_CLK_SEL       GPR_GPR4_ENET_TX_CLK_SEL_PAD
#    endif
#  endif
#  if defined(CONFIG_IMXRT_ENET2)
#    define IMXRT_ENET_IOMUXC_GPR    IMXRT_IOMUXC_GPR_GPR5
#    define imxrt_clock_enet         imxrt_clockall_enet2
#    define GPR_ENET_MASK           (GPR_GPR5_ENET1G_TX_CLK_SEL | \
                                     GPR_GPR5_ENET1G_REF_CLK_DIR)
#    define IMXRT_ENET_IRQ           IMXRT_IRQ_ENET2_1
#    define IMXRT_ENET_IRQ_2         IMXRT_IRQ_ENET2_2
#    define IMXRT_ENET_IRQ_3         IMXRT_IRQ_ENET2_3
#    define IMXRT_ENETN_BASE         IMXRT_ENET_1G_BASE
#    if defined(CONFIG_IMXRT_MAC_PROVIDES_TXC)
#      define GPR_ENET_TX_DIR        GPR_GPR5_ENET1G_REF_CLK_DIR_OUT
#      define GPR_ENET_CLK_SEL       GPR_GPR5_ENET1G_TX_CLK_SEL_CLK
#    endif
#    if defined(CONFIG_IMXRT_PHY_PROVIDES_TXC)
#      define GPR_ENET_TX_DIR         GPR_GPR5_ENET1G_REF_CLK_DIR_IN
#      define GPR_ENET_CLK_SEL        GPR_GPR5_ENET1G_TX_CLK_SEL_PAD
#    endif
#  endif
#else
#  define IMXRT_ENET_IOMUXC_GPR  IMXRT_IOMUXC_GPR_GPR1

#  if defined(CONFIG_IMXRT_ENET1)
#    define imxrt_clock_enet         imxrt_clockall_enet
#    define GPR_ENET_MASK           (GPR_GPR1_ENET1_CLK_SEL | \
                                     GPR_GPR1_ENET1_TX_DIR_OUT)
#    define IMXRT_ENET_IRQ           IMXRT_IRQ_ENET
#    define IMXRT_ENETN_BASE         IMXRT_ENET_BASE
#    if defined(CONFIG_IMXRT_MAC_PROVIDES_TXC)
#      define GPR_ENET_TX_DIR        GPR_GPR1_ENET1_TX_DIR_OUT
#      define GPR_ENET_CLK_SEL       0
#    endif
#    if defined(CONFIG_IMXRT_PHY_PROVIDES_TXC)
#      define GPR_ENET_TX_DIR        GPR_GPR1_ENET1_TX_DIR_IN
#      define GPR_ENET_CLK_SEL       GPR_GPR1_ENET1_CLK_SEL
#    endif
#  endif

