apache/nuttx/arch/arm/src/imxrt/imxrt_enet.c
  uint16_t mask = MII_KSZ80X1_INT_LDEN | MII_KSZ80X1_INT_LUEN;
  uint8_t  rreg = MII_KSZ8081_INT;
  uint8_t  wreg = rreg;

  /* Compile time YT8512 defaults */
#  if defined(CONFIG_ETH0_YT8512)
  mask = MII_YT8512_IMR_LD_EN | MII_YT8512_IMR_LU_EN;
  rreg  = MII_YT8512_ISR;
  wreg  = MII_YT8512_IMR;
#  endif

  /* Run time YT8512 defaults */
#  if defined(CONFIG_ETH0_PHY_MULTI)
  if (imxrt_phy_is(priv, MII_YT8512_NAME))
    {
      mask = MII_YT8512_IMR_LD_EN | MII_YT8512_IMR_LU_EN;
      rreg  = MII_YT8512_ISR;
      wreg  = MII_YT8512_IMR;
    }
  else if (!(imxrt_phy_is(priv, MII_KSZ8051_NAME) ||
             imxrt_phy_is(priv, MII_KSZ8061_NAME) ||
             imxrt_phy_is(priv, MII_KSZ8081_NAME) ||
             imxrt_phy_is(priv, MII_DP83825I_NAME)))
    {
      return -ENOSYS;
    }
#  endif

  /* Read the interrupt status register in order to clear any pending
   * interrupts
   */

  ret = imxrt_readmii(priv, priv->phyaddr, rreg, &phyval);
  if (ret == OK)
    {
      /* Enable link up/down interrupts */

      ret = imxrt_writemii(priv, priv->phyaddr, wreg, mask);
    }

  return ret;
#else
#  error Unrecognized PHY
  return -ENOSYS;
#  endif
}
#endif

/****************************************************************************
 * Function: imxrt_initmii
 *
 * Description:
 *   Configure the MII interface
 *
 * Input Parameters:
 *   priv - Reference to the private ENET driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void imxrt_initmii(struct imxrt_driver_s *priv)
{
  /* Speed is based on the peripheral (bus) clock; hold time is 2 module
   * clock.  This hold time value may need to be increased on some platforms
   */

  imxrt_enet_putreg32(priv, ENET_MSCR_HOLDTIME_2CYCLES |
                      IMXRT_MII_SPEED << ENET_MSCR_MII_SPEED_SHIFT,
                      IMXRT_ENET_MSCR_OFFSET);
}

/****************************************************************************
 * Function: imxrt_writemii
 *
 * Description:
 *   Write a 16-bit value to a PHY register.
 *
 * Input Parameters:
 *   priv - Reference to the private ENET driver state structure
 *   phyaddr - The PHY address
 *   regaddr - The PHY register address
 *   data    - The data to write to the PHY register
 *
 * Returned Value:
 *   Zero on success, a negated errno value on failure.
 *
 ****************************************************************************/

static int imxrt_writemii(struct imxrt_driver_s *priv, uint8_t phyaddr,
                            uint8_t regaddr, uint16_t data)
{
  int timeout;

  /* Clear the MII interrupt bit */

  imxrt_enet_putreg32(priv, ENET_INT_MII, IMXRT_ENET_EIR_OFFSET);

  /* Initiate the MII Management write */

  imxrt_enet_putreg32(priv, data |
                      2 << ENET_MMFR_TA_SHIFT |
                      (uint32_t)regaddr << ENET_MMFR_RA_SHIFT |
                      (uint32_t)phyaddr << ENET_MMFR_PA_SHIFT |
                      ENET_MMFR_OP_WRMII |
                      1 << ENET_MMFR_ST_SHIFT,
                      IMXRT_ENET_MMFR_OFFSET);

  /* Wait for the transfer to complete */

  for (timeout = 0; timeout < MII_MAXPOLLS; timeout++)
    {
      if ((imxrt_enet_getreg32(priv, IMXRT_ENET_EIR_OFFSET) &
                               ENET_INT_MII) != 0)
        {
          break;
        }
    }

  /* Check for a timeout */

  if (timeout == MII_MAXPOLLS)
    {
      return -ETIMEDOUT;
    }

  /* Clear the MII interrupt bit */

  imxrt_enet_putreg32(priv, ENET_INT_MII, IMXRT_ENET_EIR_OFFSET);
  return OK;
}

/****************************************************************************
 * Function: imxrt_reademii
 *
 * Description:
 *   Read a 16-bit value from a PHY register.
 *
 * Input Parameters:
 *   priv    - Reference to the private ENET driver state structure
 *   phyaddr - The PHY address
 *   regaddr - The PHY register address
 *   data    - A pointer to the location to return the data
 *
 * Returned Value:
 *   Zero on success, a negated errno value on failure.
 *
 ****************************************************************************/

static int imxrt_readmii(struct imxrt_driver_s *priv, uint8_t phyaddr,
                           uint8_t regaddr, uint16_t *data)
{
  int timeout;

  /* Clear the MII interrupt bit */

  imxrt_enet_putreg32(priv, ENET_INT_MII, IMXRT_ENET_EIR_OFFSET);

  /* Initiate the MII Management read */

  imxrt_enet_putreg32(priv, 2 << ENET_MMFR_TA_SHIFT |
                      (uint32_t)regaddr << ENET_MMFR_RA_SHIFT |
                      (uint32_t)phyaddr << ENET_MMFR_PA_SHIFT |
                      ENET_MMFR_OP_RDMII |
                      1 << ENET_MMFR_ST_SHIFT,
                      IMXRT_ENET_MMFR_OFFSET);

  /* Wait for the transfer to complete */

  for (timeout = 0; timeout < MII_MAXPOLLS; timeout++)
    {
      if ((imxrt_enet_getreg32(priv, IMXRT_ENET_EIR_OFFSET) &
                               ENET_INT_MII) != 0)
        {
          break;
        }
    }

  /* Check for a timeout */

  if (timeout >= MII_MAXPOLLS)
    {
      nerr("ERROR: Timed out waiting for transfer to complete\n");
      return -ETIMEDOUT;
    }

  /* Clear the MII interrupt bit */

  imxrt_enet_putreg32(priv, ENET_INT_MII, IMXRT_ENET_EIR_OFFSET);

  /* And return the MII data */

  *data = (uint16_t)(imxrt_enet_getreg32(priv, IMXRT_ENET_MMFR_OFFSET) &
                                    ENET_MMFR_DATA_MASK);
  return OK;
}

#if defined(CONFIG_ETH0_PHY_MULTI)
/****************************************************************************
 * Function: imxrt_determine_phy
 *
 * Description:
 *   Uses the board.h supplied PHY list to determine which PHY
 *   is populated on this board.
 *
 * Input Parameters:
 *   priv - Reference to the private ENET driver state structure
 *
 * Returned Value:
 *   Zero on success, a -ENOENT errno value on failure.
 *
 ****************************************************************************/

static int imxrt_determine_phy(struct imxrt_driver_s *priv)
{
  uint16_t phydata     = 0xffff;
  uint8_t phyaddr      = 0;
  uint8_t last_phyaddr = 0;
  int retries;
  int ret;

  for (priv->current_phy = 0; priv->current_phy < nitems(g_board_phys);
      priv->current_phy++)
    {
      priv->current_phy_address =
          (uint8_t) g_board_phys[priv->current_phy].address_lo;
      last_phyaddr = g_board_phys[priv->current_phy].address_high == 0xffff ?
          priv->current_phy_address :
          (uint8_t) g_board_phys[priv->current_phy].address_high;

      for (phyaddr = priv->current_phy_address; phyaddr <= last_phyaddr;
          phyaddr++)
        {
          retries = 0;
          do
            {
              nxsched_usleep(100);
              phydata = 0xffff;
              ret = imxrt_readmii(priv, phyaddr, MII_PHYID1, &phydata);
            }
          while ((ret < 0 || phydata == 0xffff) && ++retries < 3);

