apache/nuttx/arch/arm/src/imxrt/imxrt_enet.c
#  endif
#endif
#if defined (CONFIG_ETH0_PHY_LAN8720)  || \
    defined (CONFIG_ETH0_PHY_LAN8742A) || \
    defined (CONFIG_ETH0_PHY_MULTI)

#  if defined(CONFIG_ETH0_PHY_MULTI)
      if (imxrt_phy_is(priv, MII_LAN8720_NAME) ||
          imxrt_phy_is(priv, MII_LAN8742A_NAME))
        {
#  endif

          /* Make sure that PHY comes up in correct mode when it's reset */

          imxrt_writemii(priv, phyaddr, MII_LAN8720_MODES,
                         MII_LAN8720_MODES_RESV | MII_LAN8720_MODES_ALL |
                         MII_LAN8720_MODES_PHYAD(BOARD_PHY_ADDR));

          /* ...and reset PHY */

          imxrt_writemii(priv, phyaddr, MII_MCR, MII_MCR_RESET);

#  if defined(CONFIG_ETH0_PHY_MULTI)
        }
#  endif
#endif
#if defined (CONFIG_ETH0_PHY_DP83825I) || defined (CONFIG_ETH0_PHY_MULTI)

#if defined(CONFIG_ETH0_PHY_MULTI)
      if (imxrt_phy_is(priv, MII_DP83825I_NAME))
        {
#endif

          /* Reset PHY */

          imxrt_writemii(priv, phyaddr, MII_MCR, MII_MCR_RESET);

          /* Set RMII mode and Indicate 50MHz clock */

          imxrt_writemii(priv, phyaddr, MII_DP83825I_RCSR,
                        MII_DP83825I_RCSC_ELAST_2 |
                        MII_DP83825I_RCSC_RMIICS);

          imxrt_writemii(priv, phyaddr, MII_ADVERTISE,
                         MII_ADVERTISE_100BASETXFULL |
                         MII_ADVERTISE_100BASETXHALF |
                         MII_ADVERTISE_10BASETXFULL |
                         MII_ADVERTISE_10BASETXHALF |
                         MII_ADVERTISE_CSMA);

#  if defined(CONFIG_ETH0_PHY_MULTI)
        }
#  endif
#endif

#if defined(CONFIG_ETH0_PHY_YT8512) || defined(CONFIG_ETH0_PHY_MULTI)
#  if defined(CONFIG_ETH0_PHY_MULTI)
      if (!imxrt_phy_is(priv, MII_YT8512_NAME))
        {
#  endif
          /* Reset PHY */

          imxrt_writemii(priv, phyaddr, MII_MCR, MII_MCR_RESET);

          /* Config LEDs */

          imxrt_writemii(priv, phyaddr, MII_YT8512_DEBUG_ADDR_OFFSET,
                         MII_YT8512_LED0);

          imxrt_readmii(priv, phyaddr, MII_YT8512_DEBUG_DATA, &phydata);

          imxrt_writemii(priv, phyaddr, MII_YT8512_DEBUG_ADDR_OFFSET,
                         MII_YT8512_LED0);

          imxrt_writemii(priv, phyaddr, MII_YT8512_DEBUG_DATA, 0x331);

          imxrt_writemii(priv, phyaddr, MII_YT8512_DEBUG_ADDR_OFFSET,
                         MII_YT8512_LED1);

          imxrt_readmii(priv, phyaddr, MII_YT8512_DEBUG_DATA, &phydata);

          imxrt_writemii(priv, phyaddr, MII_YT8512_DEBUG_ADDR_OFFSET,
                         MII_YT8512_LED1);

          imxrt_writemii(priv, phyaddr, MII_YT8512_DEBUG_DATA, 0x30);

          /* Set negotiation */

          imxrt_writemii(priv, phyaddr, MII_ADVERTISE,
                         MII_ADVERTISE_100BASETXFULL |
                         MII_ADVERTISE_100BASETXHALF |
                         MII_ADVERTISE_10BASETXFULL |
                         MII_ADVERTISE_10BASETXHALF |
                         MII_ADVERTISE_CSMA);

#  if defined(CONFIG_ETH0_PHY_MULTI)
        }
#  endif
#endif

#if !defined(CONFIG_ETH0_PHY_TJA1103)
#if defined(CONFIG_ETH0_PHY_MULTI)
      if (!imxrt_phy_is(priv, MII_TJA1103_NAME))
        {
#endif
          /* Start auto negotiation */

          ninfo("%s: Start Autonegotiation...\n",  BOARD_PHY_NAME);
          imxrt_writemii(priv, phyaddr, MII_MCR,
                         (MII_MCR_ANRESTART | MII_MCR_ANENABLE));

          /* Wait for auto negotiation to complete */

          for (retries = 0; retries < LINK_NLOOPS; retries++)
            {
              ret = imxrt_readmii(priv, phyaddr, MII_MSR, &phydata);
              if (ret < 0)
                {
                  nerr("ERROR: Failed to read %s MII_MSR: %d\n",
                        BOARD_PHY_NAME, ret);
                  return ret;
                }

              if (phydata & MII_MSR_ANEGCOMPLETE)
                {
                  break;
                }

              nxsched_usleep(LINK_WAITUS);
            }

          if (phydata & MII_MSR_ANEGCOMPLETE)
            {
              ninfo("%s: Autonegotiation complete\n",  BOARD_PHY_NAME);
              ninfo("%s: MII_MSR: %04x\n", BOARD_PHY_NAME, phydata);
            }
          else
            {
              /* TODO: Autonegotiation has right now failed. Maybe the Eth
               * cable is not connected.  PHY chip have mechanisms to
               * configure link OK. We should leave autconf on, and find a
               * way to re-configure MCU whenever the link is ready.
               */

              ninfo("%s: Autonegotiation failed [%d] (is cable plugged-in ?)"
                    ", default to 10Mbs mode\n",
                    BOARD_PHY_NAME, retries);

              /* Stop auto negotiation */

              imxrt_writemii(priv, phyaddr, MII_MCR, 0);
            }
#  if defined(CONFIG_ETH0_PHY_MULTI)
        }
#  endif
#endif
    }

#if !defined(CONFIG_ETH0_PHY_TJA1103)
#  if defined(CONFIG_ETH0_PHY_MULTI)
  if (!imxrt_phy_is(priv, MII_TJA1103_NAME))
    {
#  endif
      /* When we get here we have a (negotiated) speed and duplex. This
       * is also the point we enter if renegotiation is turned off, so have
       * multiple attempts at reading the status register in case the PHY
       * isn't awake properly.
       */

      retries = 0;
      do
        {
          phydata = 0xffff;
          ret = imxrt_readmii(priv, phyaddr, BOARD_PHY_STATUS, &phydata);
        }
      while ((ret < 0 || phydata == 0xffff) && ++retries < 3);

      /* If we didn't successfully read anything and we haven't tried
       * a physical renegotiation then lets do that
       */

      if (retries >= 3)
        {
          if (renogphy == false)
            {
              /* Give things one more chance with renegotiation turned on */

              return imxrt_initphy(priv, true);
            }
          else
            {
              /* That didn't end well, just give up */

              nerr("ERROR: Failed to read %s BOARD_PHY_STATUS[%02x]: %d\n",
                   BOARD_PHY_NAME, BOARD_PHY_STATUS, ret);
              return ret;
            }
        }

      ninfo("%s: BOARD_PHY_STATUS: %04x\n", BOARD_PHY_NAME, phydata);
#  if defined(CONFIG_ETH0_PHY_MULTI)
    }
#  endif
#endif

  /* Set up the transmit and receive control registers based on the
   * configuration and the auto negotiation results.
   */

#ifdef CONFIG_IMXRT_ENETUSEMII
  rcr = ENET_RCR_CRCFWD |
        (CONFIG_NET_ETH_PKTSIZE + CONFIG_NET_GUARDSIZE)
          << ENET_RCR_MAX_FL_SHIFT |
        ENET_RCR_MII_MODE;
#else
  rcr = ENET_RCR_RMII_MODE | ENET_RCR_CRCFWD |
        (CONFIG_NET_ETH_PKTSIZE + CONFIG_NET_GUARDSIZE)
          << ENET_RCR_MAX_FL_SHIFT |
        ENET_RCR_MII_MODE;
#endif
  tcr = 0;

  imxrt_enet_putreg32(priv, rcr, IMXRT_ENET_RCR_OFFSET);
  imxrt_enet_putreg32(priv, tcr, IMXRT_ENET_TCR_OFFSET);

  /* Enable Discard Of Frames With MAC Layer Errors.
   * Enable Discard Of Frames With Wrong Protocol Checksum.
   * Bit 1: Enable discard of frames with wrong IPv4 header checksum.
   */

  racc = ENET_RACC_PRODIS | ENET_RACC_LINEDIS | ENET_RACC_IPDIS;
  imxrt_enet_putreg32(priv, racc, IMXRT_ENET_RACC_OFFSET);

  /* Setup half or full duplex */

  if (BOARD_PHY_ISDUPLEX(phydata))
    {
      /* Full duplex */

      ninfo("%s: Full duplex\n",  BOARD_PHY_NAME);
      tcr |= ENET_TCR_FDEN;
    }
  else
    {
      /* Half duplex */

      ninfo("%s: Half duplex\n",  BOARD_PHY_NAME);
      rcr |= ENET_RCR_DRT;
    }

  if (BOARD_PHY_10BASET(phydata))
    {
      /* 10 Mbps */

      ninfo("%s: 10 Base-T\n",  BOARD_PHY_NAME);
      rcr |= ENET_RCR_RMII_10T;
    }
  else if (BOARD_PHY_100BASET(phydata))
    {
      /* 100 Mbps */

      ninfo("%s: 100 Base-T\n",  BOARD_PHY_NAME);
    }
  else
    {
      /* This might happen if Autonegotiation did not complete(?) */

      nerr("ERROR: Neither 10- nor 100-BaseT reported: PHY STATUS=%04x\n",
           phydata);
      return -EIO;
    }

  imxrt_enet_putreg32(priv, rcr, IMXRT_ENET_RCR_OFFSET);
  imxrt_enet_putreg32(priv, tcr, IMXRT_ENET_TCR_OFFSET);
  return OK;
}

/****************************************************************************
 * Function: imxrt_initbuffers
 *
 * Description:
 *   Initialize ENET buffers and descriptors
 *
 * Input Parameters:
 *   priv - Reference to the private ENET driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void imxrt_initbuffers(struct imxrt_driver_s *priv)
{
  uintptr_t addr;
  int i;

  /* Get an aligned TX descriptor (array) address */

  priv->txdesc = &g_desc_pool[0];

